diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформление();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников
&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	ОтпускаСотрудниковПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда)
	
	Адрес = ПолучитьДанныеДляДиограммы();
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресХранилища", Адрес); 
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтпускаСотрудниковПриИзмененииНаСервере()
	УстановитьУсловноеОформление();
	ЭтотОбъект.Записать();
	Элементы.ОтпускаСотрудников.Обновить();
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление() 
	
	Если Объект.ОтпускаСотрудников.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнена табличная часть документа",,"ОтпускаСотрудников","Объект.ОтпускаСотрудников");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
	               |	СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ)) КАК ДнейОтпуска
	               |ПОМЕСТИТЬ ДТ_ДанныеДокумента
	               |ИЗ
	               |	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
	               |ГДЕ
	               |	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДТ_ДанныеДокумента.Сотрудник КАК Сотрудник,
	               |	ДТ_ДанныеДокумента.ДнейОтпуска КАК ДнейОтпуска
	               |ИЗ
	               |	ДТ_ДанныеДокумента КАК ДТ_ДанныеДокумента
	               |ГДЕ
	               |	ДТ_ДанныеДокумента.ДнейОтпуска > 28";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеОтбора = Новый Структура();
	
	Пока Выборка.Следующий() Цикл 
		
		ДанныеОтбора.Вставить("Сотрудник", Выборка.Сотрудник); 
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОтпускаСотрудников.Имя);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУсловногоОформления.Отбор,
		"Объект.ОтпускаСотрудников.Сотрудник", ВидСравненияКомпоновкиДанных.Равно,ДанныеОтбора.Сотрудник);
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СеребристоСерый); 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляДиограммы()
	
	ДанныеДокумента = Объект.ОтпускаСотрудников.Выгрузить();
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеДокумента, Новый УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти
